""" Bubble sort 알고리즘을 구현한다. """

################################################################################
# bubble_sort:
# input: 리스트 A
# return: 정렬된 리스트 A
################################################################################
def bubble_sort(A):
    
    for i in range(0, len(A) - 1):
        # 바꾸는 작업이 일어나는지 판단하는 변수 
        exchange = False
        for j in range(0, len(A) - 1):
            if A[j] > A[j + 1]:
                exchange = True
                A[j], A[j + 1] = A[j + 1], A[j]
        # 바꾸는 작업이 일어나지 않았다면 더 이상의 연산은 불필요.
        if not exchange:
            return A
        print(A)
        
    return A
################################################################################


################################################################################
""" Script """
################################################################################
A = [5, 1, 2, 3, 4]
bubble_sort(A)