""" A 라는 array를 받아서 insertion sort를 이용하여 정렬한다. """

####################################################################
# reverse_insertion_sort: 
# Input: list A
# Return: sorted list A
####################################################################
def reverse_insertion_sort(A):
    # A[0] 는 그자리에 그대로 두고 A[1] 부터 A[:] 까지 자기 자리를 오른쪽에서 왼쪽으로 가며 찾는다. 
    for i in range(1, len(A)):
        j = i - 1
        while (j >= 0) and (A[j + 1] < A[j]):
            A[j + 1], A[j] = A[j], A[j + 1]
            j -= 1
        print(A)
            
    return A
####################################################################

####################################################################
""" Script """
####################################################################
A = [i for i in range(1, 10)]
print(reverse_insertion_sort(A))